chcbaram/NUCLEO-C5A3ZG/firmware/stm32c5-ai/src/lib/lwip/interfaces/ethernet/eth_interface_freertos.c
/**
  ******************************************************************************
  * @file           : eth_interface_freertos.c
  * @brief          : LwIP STM32 FreeRTOS ethernet interface.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "eth_interface_freertos.h"
#include "lwip/netifapi.h"

#include "stm32_hal.h"
#include "mx_lwip.h"

#include "FreeRTOS.h"
#include "queue.h"
#include "task.h"
#include "semphr.h"

#include "string.h"
/* Private defines -----------------------------------------------------------*/

/**
  * @brief  Get Rx channel index (starting from 0) from HAL ETH Rx channel ID
  */
#define GET_RX_CHANNEL_INDEX_FROM_HAL_ETH_RX_CHANNEL_ID(channel_rx) ((channel_rx / HAL_ETH_RX_CHANNEL_0) - 1)

/**
  * @brief  Get Tx channel index (starting from 0) from HAL ETH Tx channel ID
  */
#define GET_TX_CHANNEL_INDEX_FROM_HAL_ETH_TX_CHANNEL_ID(channel_tx) ((channel_tx / HAL_ETH_TX_CHANNEL_0) - 1)

/**
  * @brief Align allocated descriptor memory according to alignment constraint
  */
#define ALIGN_DESC_MEM(p_mem_start, align) (void*)((uint32_t)(p_mem_start)\
                                                   + (align) - ((uint32_t)(p_mem_start) % (align)))

/* Private typedef -----------------------------------------------------------*/

/**
  * @brief Message types for the data worker thread.
  */
typedef enum
{
  ERR_MSG,           /**< Error message. */
  DATA_HW_EVENT,     /**< Hardware data event (incoming RX). */
  MW_OUTPUT_BUFFER   /**< Middleware output buffer to be transmitted. */
} data_worker_msg_type_t;

/**
  * @brief Message structure for communication with the data worker thread.
  */
typedef struct
{
  data_worker_msg_type_t type;   /**< Type of the message. */
  uint32_t channels_set;         /**< Bitmask of channels associated with the event. */
  struct pbuf *pbuf;             /**< Pointer to the pbuf (for TX or RX). */
  struct netif *netif;           /**< Pointer to the LwIP network interface. */
  hal_eth_handle_t *p_eth;       /**< Pointer to the hardware ETH handle. */
} data_worker_message_t;

/**
  * @brief State structure for PHY (physical layer) management.
  *
  * Maintains the current PHY mode and a list of associated network interfaces.
  */
typedef struct
{
  lwip_eth_interface_hardware_t *p_hardware;     /**< Pointer to the associated hardware abstraction. */
  mx_phy_link_mode_t phy_mode_current;           /**< Current PHY link mode (speed, duplex, status). */
  struct netif *netifs[MX_LWIP_MAX_INTERFACE_NB];/**< Array of pointers to associated LwIP network interfaces. */
} phy_state_t;

/* Private variables ---------------------------------------------------------*/
/**
  * @brief Mutex for protecting access to the network interface context table.
  */
static SemaphoreHandle_t netif_context_table_mutex;

/**
  * @brief Mutex for protecting access to the PHY state table.
  */
static SemaphoreHandle_t phy_state_table_mutex;

/**
  * @brief Table of pointers to registered network interface contexts.
  *
  * Each entry corresponds to a registered LwIP network interface.
  */
static lwip_eth_interface_netif_context_t *netif_context_table[MX_LWIP_MAX_INTERFACE_NB] = {};

/**
  * @brief Table of PHY state structures.
  *
  * Each entry manages the PHY state and associated netifs for a hardware instance.
  */
static phy_state_t phy_state_table[MX_LWIP_MAX_INTERFACE_NB] = {};

/**
  * @brief Table of pointers to the first pbuf for each RX channel.
  *
  * Used to track the start of a received frame for each hardware RX channel.
  */
struct pbuf *first_pbuf_table[MX_LWIP_MAX_INTERFACE_NB] = {0};

/**
  * @brief Table of pointers storing allocated Rx descriptors pointers
  *
  */
void *rx_desc_pointer_table[MX_LWIP_MAX_INTERFACE_NB] = {0};

/**
  * @brief Table of pointers storing allocated Tx descriptors pointers
  *
  */
void *tx_desc_pointer_table[MX_LWIP_MAX_INTERFACE_NB] = {0};

/**
  * @brief Pointer to the array of Ethernet TX buffers.
  *
  * Used for transmitting frames via the hardware.
  */
static hal_eth_buffer_t *eth_tx_buffer = NULL;

/**
  * @brief Handle for the data worker FreeRTOS task.
  */
static TaskHandle_t data_worker_task = NULL;

/**
  * @brief Handle for the link monitor FreeRTOS task.
  */
static TaskHandle_t link_monitor_task = NULL;

/**
  * @brief Queue handle for messages to the data worker thread.
  */
static QueueHandle_t data_worker_queue = NULL;

/**
  * @brief Ethernet 인터페이스 통계 카운터.
  *
  * RX 오버로드 시 assert 대신 누적된다. 외부에서는 lwip_eth_interface_get_stats()
  * 로만 접근한다(캡슐화).
  *   - rx_drop_mbox : tcpip_input() ERR_MEM (tcpip mailbox / MSG_INPKT 고갈)
  *   - rx_drop_pbuf : rx_allocate_cb의 pbuf_alloc(PBUF_POOL) 실패
  */
static volatile lwip_eth_interface_stats_t s_eth_stats = {0};

/**
  * @brief Flag to control the running state of the data worker thread.
  */
static volatile BaseType_t RunDataWorkerThread = pdTRUE;

/**
  * @brief Flag to control the running state of the link monitor thread.
  */
static volatile BaseType_t RunLinkMonitorThread = pdTRUE;


/* Private function prototypes -----------------------------------------------*/
/**
  * @brief Add a network interface context to the internal table.
  * @param[in] p_netif_context Pointer to the network interface context.
  * @return ERR_OK on success, ERR_MEM if already exists or no space.
  */
static err_t netif_context_add_to_table(lwip_eth_interface_netif_context_t *p_netif_context);

/**
  * @brief Remove a network interface context from the internal table.
  * @param[in] p_netif_context Pointer to the network interface context.
  * @return true if successfully removed, false otherwise.
  */
static bool netif_context_remove_from_table(lwip_eth_interface_netif_context_t *p_netif_context);

/**
  * @brief Compare two network interface contexts for equality.
  * @param[in] p1 Pointer to the first network interface context.
  * @param[in] p2 Pointer to the second network interface context.
  * @return true if equal, false otherwise.
  */
static bool netif_context_equals(lwip_eth_interface_netif_context_t *p1, lwip_eth_interface_netif_context_t *p2);

/**
  * @brief Check if the network interface context table is empty.
  * @return true if empty, false otherwise.
  */
static bool netif_context_table_is_empty(void);

/**
  * @brief Add a network interface context to the PHY state table.
  * @param[in] p_netif_context Pointer to the network interface context.
  * @return ERR_OK on success, ERR_ALREADY if already present, ERR_MEM if no space.
  */
static err_t phy_state_add_to_table(lwip_eth_interface_netif_context_t *p_netif_context);

/**
  * @brief Remove a network interface context from the PHY state table.
  * @param[in] p_netif_context Pointer to the network interface context.
  */
static void phy_state_remove_from_table(lwip_eth_interface_netif_context_t *p_netif_context);

/**
  * @brief Add a netif pointer to a PHY state.
  * @param[in] p_phy_state Pointer to the PHY state.
  * @param[in] p_netif Pointer to the LwIP network interface.
  * @return ERR_OK on success, ERR_ALREADY if already present, ERR_MEM if no space.
  */
static err_t netif_add_to_phy_state(phy_state_t *p_phy_state, struct netif *p_netif);

/**
  * @brief Check if a hardware interface is used by any network interface.
  * @param[in] p_netif_context Pointer to the network interface context.
  * @return true if used, false otherwise.
  */
static bool hardware_interface_is_used(lwip_eth_interface_netif_context_t *p_netif_context);

/**
  * @brief Get the netif pointer from the table based on ETH instance, RX channel, and VLAN ID.
  * @param[in] p_eth Pointer to the ETH handle.
  * @param[in] rx_channel RX channel ID.
  * @param[in] rx_vlan_id VLAN ID.
  * @return Pointer to the LwIP network interface, or NULL if not found.
  */
static struct netif *get_netif_from_table(hal_eth_handle_t *p_eth, uint32_t rx_channel, uint32_t rx_vlan_id);

/**
  * @brief Notify the HAL ETH of a link update (speed/duplex).
  * @param[in] p_eth Pointer to the ETH handle.
  * @param[in] p_phy_link_mode Pointer to the PHY link mode.
  */
static void link_update_notify_hal_eth(hal_eth_handle_t *p_eth, mx_phy_link_mode_t *p_phy_link_mode);

/**
  * @brief Thread function for monitoring PHY link status.
  * @param[in] arg Unused.
  */
static void phy_link_monitor_thread(void *arg);

/**
  * @brief Data worker thread for handling data input/output events.
  * @param[in] arg Unused.
  */
static void data_worker_thread(void *arg);


/**
  * @brief Callback for completed Ethernet TX transfer.
  * @param[in] p_eth Pointer to the ETH handle.
  * @param[in] channel Channel ID.
  * @param[in] tx_pkt_addr Address of the transmitted packet.
  * @param[in] tx_pkt_data TX packet data structure.
  * @return HAL_OK on success.
  */
static hal_status_t tx_complete_cb(hal_eth_handle_t *p_eth, uint32_t channel,
                                   void *tx_pkt_addr, hal_eth_tx_cb_pkt_data_t tx_pkt_data);

/**
  * @brief Callback for completed Ethernet RX transfer.
  * @param[in] p_eth Pointer to the ETH handle.
  * @param[in] channel Channel ID.
  * @param[in] rx_pkt_address Address of the received packet.
  * @param[in] rx_pkt_size Size of the received packet.
  * @param[in] rx_pkt_data RX packet data structure.
  * @return HAL_OK on success, HAL_BUSY if input failed.
  */
static hal_status_t rx_complete_cb(hal_eth_handle_t *p_eth, uint32_t channel,
                                   void *rx_pkt_address, uint32_t rx_pkt_size,
                                   hal_eth_rx_cb_pkt_data_t rx_pkt_data);

/**
  * @brief Callback for hardware data events (from ISR).
  * @param[in] p_eth Pointer to the ETH handle.
  * @param[in] channel Channel mask (bitfield of channels with pending events).
  */
static void data_event_cb(hal_eth_handle_t *p_eth, uint32_t channel);

/**
  * @brief Callback to allocate a buffer for Ethernet reception.
  * @param[in] p_eth Pointer to the ETH handle.
  * @param[in] channel Channel ID.
  * @param[in] rx_buf_size Size of the RX buffer.
  * @param[out] p_rx_buffer Pointer to the allocated buffer.
  * @param[out] p_app_context Pointer to the application context (pbuf).
  */
static void rx_allocate_cb(hal_eth_handle_t *p_eth, uint32_t channel,
                           uint32_t rx_buf_size, void **p_rx_buffer,
                           void **p_app_context);
/* Private Functions Definitions ---------------------------------------------*/


static err_t netif_context_add_to_table(lwip_eth_interface_netif_context_t *p_netif_context)
{
  err_t status = ERR_OK;
  xSemaphoreTake(netif_context_table_mutex, portMAX_DELAY);
  for (int i = 0 ; i < MX_LWIP_MAX_INTERFACE_NB ; i++)
  {
    if (netif_context_equals(netif_context_table[i], p_netif_context) == true)
    {
      /* Already existing */
      status = ERR_MEM;
      break;
    }
  }

  if (status == ERR_OK)
  {
    for (int i = 0 ; i < MX_LWIP_MAX_INTERFACE_NB ; i++)
    {
      if (netif_context_table[i] == NULL)
      {
        /* Found empty slot */
        netif_context_table[i] = p_netif_context;
        status = ERR_OK;
        break;
      }
    }
  }
  xSemaphoreGive(netif_context_table_mutex);

