chcbaram/NUCLEO-C5A3ZG/firmware/stm32c5-ai/src/lib/lwip/interfaces/ethernet/eth_interface_freertos.c
  return status;
}

static bool netif_context_remove_from_table(lwip_eth_interface_netif_context_t *p_netif_context)
{
  bool removed = false;
  xSemaphoreTake(netif_context_table_mutex, portMAX_DELAY);
  for (int i = 0 ; i < MX_LWIP_MAX_INTERFACE_NB ; i++)
  {
    if (netif_context_equals(netif_context_table[i], p_netif_context) == true)
    {
      netif_context_table[i] = NULL;
      removed = true;
      break;
    }
  }
  xSemaphoreGive(netif_context_table_mutex);
  return removed;
}

static bool netif_context_table_is_empty(void)
{
  bool is_empty = true;
  xSemaphoreTake(netif_context_table_mutex, portMAX_DELAY);
  for (int i = 0 ; i < MX_LWIP_MAX_INTERFACE_NB ; i++)
  {
    if (netif_context_table[i] != NULL)
    {
      /* There is still an interface registered */
      is_empty = false;
      break;
    }
  }
  xSemaphoreGive(netif_context_table_mutex);
  return is_empty;
}

static err_t netif_add_to_phy_state(phy_state_t *p_phy_state, struct netif *p_netif)
{
  err_t status = ERR_OK;
  for (int i = 0 ; i < MX_LWIP_MAX_INTERFACE_NB; i++)
  {
    if (p_phy_state->netifs[i] == p_netif)
    {
      status = ERR_ALREADY;
      break;
    }
  }
  if (status == ERR_OK)
  {
    status = ERR_MEM;
    for (int i = 0 ; i < MX_LWIP_MAX_INTERFACE_NB; i++)
    {
      if (p_phy_state->netifs[i] == NULL)
      {
        p_phy_state->netifs[i] = p_netif;
        status = ERR_OK;
        break;
      }
    }
  }
  return status;
}

static err_t phy_state_add_to_table(lwip_eth_interface_netif_context_t *p_netif_context)
{
  err_t status = ERR_OK;
  xSemaphoreTake(phy_state_table_mutex, portMAX_DELAY);
  for (int i = 0 ; i < MX_LWIP_MAX_INTERFACE_NB ; i++)
  {
    if (phy_state_table[i].p_hardware != NULL)
    {
      if (phy_state_table[i].p_hardware->p_eth == p_netif_context->p_hardware->p_eth)
      {
        /* Already existing, add netif pointer to list to be notified */
        status = netif_add_to_phy_state(&phy_state_table[i], p_netif_context->p_netif);
        if (status == ERR_OK)
        {
          status = ERR_ALREADY;
        }
        else
        {
          status = ERR_MEM;
        }
        break;
      }
    }
  }

  if (status == ERR_OK)
  {
    status = ERR_MEM;
    for (int i = 0 ; i < MX_LWIP_MAX_INTERFACE_NB ; i++)
    {
      if (phy_state_table[i].p_hardware == NULL)
      {
        /* Found empty slot */
        phy_state_table[i].p_hardware = p_netif_context->p_hardware;
        MX_PHY_LINK_MODE_CLEAR(&(phy_state_table[i].phy_mode_current));
        status = netif_add_to_phy_state(&phy_state_table[i], p_netif_context->p_netif);
        if (status == ERR_ALREADY)
        {
          status = ERR_MEM;
        }
        break;
      }
    }
  }

  xSemaphoreGive(phy_state_table_mutex);
  return status;

}

static void phy_state_remove_from_table(lwip_eth_interface_netif_context_t *p_netif_context)
{
  err_t status = ERR_OK;
  xSemaphoreTake(phy_state_table_mutex, portMAX_DELAY);
  for (int i = 0 ; i < MX_LWIP_MAX_INTERFACE_NB ; i++)
  {
    if (phy_state_table[i].p_hardware == NULL)
    {
      continue;
    }
    if (phy_state_table[i].p_hardware->p_eth == p_netif_context->p_hardware->p_eth)
    {
      for (int j = 0 ; j < MX_LWIP_MAX_INTERFACE_NB; j++)
      {
        if (phy_state_table[i].netifs[j] == p_netif_context->p_netif)
        {
          phy_state_table[i].netifs[j] = NULL;
        }
        if (phy_state_table[i].netifs[j] != NULL)
        {
          status = ERR_ALREADY;
        }
      }
      if (status == ERR_OK)
      {
        memset(&phy_state_table[i], 0, sizeof(phy_state_t));
      }
      break;
    }
  }
  xSemaphoreGive(phy_state_table_mutex);
}

static bool hardware_interface_is_used(lwip_eth_interface_netif_context_t *p_netif_context)
{
  xSemaphoreTake(netif_context_table_mutex, portMAX_DELAY);
  bool hardware_interface_found = false;
  for (int i = 0 ; i < MX_LWIP_MAX_INTERFACE_NB ; i++)
  {
    lwip_eth_interface_netif_context_t *p_i = netif_context_table[i];

    if (p_i == NULL)
    {
      continue;
    }

    if ((p_netif_context->p_hardware->p_eth == p_i->p_hardware->p_eth)
        && (p_netif_context->rx_channel_id == p_i->rx_channel_id)
        && (p_netif_context->tx_channel_id == p_i->tx_channel_id))
    {
      hardware_interface_found = true;
      break;
    }
  }
  xSemaphoreGive(netif_context_table_mutex);
  return hardware_interface_found;
}

/**
  * @brief  obtain netif pointer from ETH instance, RX channel id, vlan ID.
  * @param  heth: ETH handle
  * @retval struct netif *
  */
static struct netif *get_netif_from_table(hal_eth_handle_t *p_eth, uint32_t rx_channel, uint32_t rx_vlan_id)
{
  struct netif *p_netif = NULL;
  xSemaphoreTake(netif_context_table_mutex, portMAX_DELAY);

  for (int i = 0 ; i < MX_LWIP_MAX_INTERFACE_NB ; i++)
  {
    if (netif_context_table[i] != NULL)
    {
      if ((netif_context_table[i]->p_hardware->p_eth == p_eth) && (netif_context_table[i]->rx_channel_id == rx_channel)
          && (netif_context_table[i]->vlan_id == rx_vlan_id))
      {
        p_netif = netif_context_table[i]->p_netif;
        break;
      }
    }
  }
  xSemaphoreGive(netif_context_table_mutex);
  return p_netif;
}

static bool netif_context_equals(lwip_eth_interface_netif_context_t *p1, lwip_eth_interface_netif_context_t *p2)
{
  if ((p1 == NULL) || (p2 == NULL))
  {
    return false;
  }

  if ((p1->vlan_id == p2->vlan_id)
      && (p1->p_hardware->p_eth == p2->p_hardware->p_eth)
      && (p1->rx_channel_id == p2->rx_channel_id)
      && (p1->tx_channel_id == p2->tx_channel_id))
  {
    return true;
  }
  return false;
}

static void link_update_notify_hal_eth(hal_eth_handle_t *p_eth, mx_phy_link_mode_t *p_phy_link_mode)
{
  hal_eth_link_config_t eth_link_config;

  switch (p_phy_link_mode->speed)
  {
    case MX_PHY_LINK_SPEED_10:
      eth_link_config.speed = HAL_ETH_MAC_SPEED_10M;
      break;
    case MX_PHY_LINK_SPEED_100:
      eth_link_config.speed = HAL_ETH_MAC_SPEED_100M;
      break;
#if defined(MX_LWIP_ETH_GIGABIT_SUPPORT) && (MX_LWIP_ETH_GIGABIT_SUPPORT == 1)
    case MX_PHY_LINK_SPEED_1000:
      eth_link_config.speed = HAL_ETH_MAC_SPEED_1000M;
      break;
#endif /* if defined(MX_LWIP_ETH_GIGABIT_SUPPORT) */
    default:
      /* MAC speed not changed on purpose */
      break;
  }
  switch (p_phy_link_mode->duplex)
  {
    case MX_PHY_LINK_HALF_DUPLEX:
      eth_link_config.duplex_mode = HAL_ETH_MAC_HALF_DUPLEX_MODE;
      break;
    case MX_PHY_LINK_FULL_DUPLEX:
      eth_link_config.duplex_mode = HAL_ETH_MAC_FULL_DUPLEX_MODE;
      break;
    default:
      /* MAC duplex mode not changed on purpose */
      break;
  }
  HAL_ETH_UpdateConfigLink(p_eth, &eth_link_config);
}

void phy_link_monitor_thread(void *arg)
{
  RunLinkMonitorThread = pdTRUE;

  while (RunLinkMonitorThread == pdTRUE)
  {
    xSemaphoreTake(phy_state_table_mutex, portMAX_DELAY);
    for (int i_phy = 0 ; i_phy < MX_LWIP_MAX_INTERFACE_NB ; i_phy++)
    {
      if (phy_state_table[i_phy].p_hardware != NULL)
      {
        lwip_eth_interface_hardware_t *p_hardware = phy_state_table[i_phy].p_hardware;

        mx_phy_link_mode_t new_phy_link_mode;
        mx_phy_link_mode_t *current_phy_link_mode = &(phy_state_table[i_phy].phy_mode_current);

        p_hardware->p_phy->get_link_mode(&new_phy_link_mode);

        if ((new_phy_link_mode.status != current_phy_link_mode->status)
            || (new_phy_link_mode.speed != current_phy_link_mode->speed)
            || (new_phy_link_mode.duplex != current_phy_link_mode->duplex))
        {
          if ((new_phy_link_mode.status == MX_PHY_LINK_DOWN)
              && (new_phy_link_mode.status != current_phy_link_mode->status))
          {
            for (int i_netif = 0 ; i_netif < MX_LWIP_MAX_INTERFACE_NB ; i_netif++)
            {
              if (phy_state_table[i_phy].netifs[i_netif] != NULL)
              {
                netifapi_netif_set_link_down(phy_state_table[i_phy].netifs[i_netif]);
              }
            }
          }
          else if (new_phy_link_mode.status == MX_PHY_LINK_UP)
          {
            /* Notify HAL ETH that link mode has changed */
            link_update_notify_hal_eth(p_hardware->p_eth, &new_phy_link_mode);
            for (int i_netif = 0 ; i_netif < MX_LWIP_MAX_INTERFACE_NB ; i_netif++)
            {
              if (phy_state_table[i_phy].netifs[i_netif] != NULL)
              {
                netifapi_netif_set_link_up(phy_state_table[i_phy].netifs[i_netif]);
              }
            }
          }
        }
        /* Store new phy link mode */
        *current_phy_link_mode = new_phy_link_mode;
      }
    }
    xSemaphoreGive(phy_state_table_mutex);

