chcbaram/NUCLEO-C5A3ZG/firmware/stm32c5-ai/src/lib/lwip/interfaces/ethernet/eth_interface_freertos.c
    /* Wait for notification from ISR or timeout for periodic polling */
    ulTaskNotifyTake(pdTRUE, pdMS_TO_TICKS(MX_LWIP_LINK_MONITOR_PERIOD_MS));
  }

  vTaskDelete(NULL);
}

void data_worker_thread(void *arg)
{
  uint32_t buffer_count;
  data_worker_message_t message;
  struct pbuf *pbuf = NULL;
  hal_status_t hal_status = HAL_OK;
  uint32_t output_channel_mask;
  hal_eth_tx_pkt_config_t tx_pkt_conf = {0};
  lwip_eth_interface_netif_context_t *p_netif_context;

  tx_pkt_conf.attributes = HAL_ETH_TX_PKT_CTRL_CSUM | HAL_ETH_TX_PKT_CTRL_CRCPAD;
  tx_pkt_conf.crc_pad_ctrl = HAL_ETH_TX_PKT_CRC_PAD_INSERT;
  tx_pkt_conf.csum_ctrl = HAL_ETH_TX_PKT_CSUM_PAYLOAD_HEADER_INSERT;

  RunDataWorkerThread = pdTRUE;

  while (RunDataWorkerThread == pdTRUE)
  {
    ulTaskNotifyTake(true, portMAX_DELAY);
    while (xQueueReceive(data_worker_queue, &message, (TickType_t) 0) == true)
    {
      if (message.type == DATA_HW_EVENT)
      {
        HAL_ETH_ExecDataHandler(message.p_eth, message.channels_set, &output_channel_mask);
      }
      else if (message.type == MW_OUTPUT_BUFFER)
      {
        p_netif_context = (lwip_eth_interface_netif_context_t *)message.netif->state;

        /* foreach pbuf in the linked list */
        for (pbuf = message.pbuf, buffer_count = 0;
             (pbuf != NULL) && (buffer_count < MX_LWIP_MAX_ETH_TX_BUFFERS);
             buffer_count++, pbuf = pbuf->next)
        {
          eth_tx_buffer[buffer_count].p_buffer = pbuf->payload;
          eth_tx_buffer[buffer_count].len_byte = pbuf->len;
        }
        /* record the first pbuf in tx_pkt_conf.p_data */
        /* it will be used to free the entire pbuf chain when last eth_tx_buffer transfer is complete */
        /* NOTE: this must be updated if the TX buffers notification strategy is changed */
        tx_pkt_conf.p_data = (void *)message.pbuf;
        if (p_netif_context->vlan_id != 0)
        {
          tx_pkt_conf.attributes |= HAL_ETH_TX_PKT_CTRL_VLANTAG;
          tx_pkt_conf.vlan_tag_id = p_netif_context->vlan_id;
          tx_pkt_conf.vlan_ctrl = HAL_ETH_TX_PKT_VLAN_INSERT;
        }

        do
        {
          hal_status = HAL_ETH_RequestTx(p_netif_context->p_hardware->p_eth,
            p_netif_context->tx_channel_id, eth_tx_buffer, buffer_count, &tx_pkt_conf);

          if (hal_status == HAL_BUSY)
          {
            /* TX 링이 가득 참: TX 완료뿐 아니라 RX(ACK) 채널도 함께 처리해
               버스트 도중 ACK 처리가 밀리는 head-of-line blocking 을 완화한다. */
            HAL_ETH_ExecDataHandler(p_netif_context->p_hardware->p_eth,
              p_netif_context->tx_channel_id | p_netif_context->rx_channel_id, &output_channel_mask);
          }
        } while (hal_status == HAL_BUSY);

      }
      else
      {
        /* other message type ? */
        LWIP_ASSERT("data_worker_thread message.type unknown\n", 0);
      }
    }
  }
  vTaskDelete(NULL);
}

void rx_allocate_cb(hal_eth_handle_t *p_eth, uint32_t channel,
                    uint32_t rx_buf_size, void **p_rx_buffer,
                    void **p_app_context)
{
  /* need to check the channel, app_context */
  /* there can be cases where different buffer pools are used depending from channel / netif */

  struct pbuf *p = pbuf_alloc(PBUF_RAW, rx_buf_size, PBUF_POOL);
  if (p)
  {
    /* Get a pointer to payload. */
    *p_rx_buffer = p->payload;
    *p_app_context = p;
  }
  else
  {
    /* PBUF_POOL 고갈 = RX 오버로드. HAL은 NULL 버퍼를 만나면 해당 디스크립터
       할당을 멈추고(MAC이 패킷 드롭) 다음 기회에 다시 요청하므로 crash 없이
       안전하다. assert 대신 드롭 카운터만 올린다. */
    *p_rx_buffer = NULL;
    s_eth_stats.rx_drop_pbuf++;
  }
}

/**
  * @brief  Ethernet Tx Transfer completed callback.
  *         Called from HAL_ETH_ExecHandler() when an ethernet frame
  *         or part of frame is sent.
  *         An ethernet frame can be sent in several buffers.
  *         The last part has a specific status flag that indicates the full
  *         transfer is complete.
  * @param  heth: ETH handle
  * @retval None
  */
hal_status_t tx_complete_cb(hal_eth_handle_t *p_eth, uint32_t channel,
                            void *tx_pkt_addr, hal_eth_tx_cb_pkt_data_t tx_pkt_data)
{
  /* if it is the last buffer of full frame, free all the linked list of pbufs */
  /* pbuf_free(pbuf); */ /* one call to pbuf_free() on first pbuf frees the entire chain */

  /* handle the channel */

  /* handle the buffer */
  struct pbuf *pbuf = NULL;
  if (tx_pkt_data.errors == 0) /* to be checked */
  {
    if ((tx_pkt_data.status & HAL_ETH_TX_STATUS_LD) == HAL_ETH_TX_STATUS_LD)
    {
      /* if it is the last buffer of full frame, free all the linked list of pbufs */
      if (tx_pkt_data.p_data != NULL)
      {
        /* the first LwIP pbuf in the chain was recorded in tx_pkt_data.p_data. */
        pbuf = (struct pbuf *)tx_pkt_data.p_data;
        /* free the entire pbuf chain */
        pbuf_free(pbuf);
      }
      else
      {
        LWIP_ASSERT("tx_pkt_data.status == HAL_ETH_TX_STATUS_LD and tx_pkt_data.p_data != NULL",
                    (tx_pkt_data.p_data != NULL));
      }
    }
  }
  else
  {
    LWIP_ASSERT("tx_pkt_data.errors == 0", (tx_pkt_data.errors == 0));
  }
  return HAL_OK;
}

void data_event_cb(hal_eth_handle_t *p_eth, uint32_t channel)
{
  BaseType_t xHigherPriorityTaskWoken1 = false;
  BaseType_t xHigherPriorityTaskWoken2 = false;
  data_worker_message_t message;
  message.type = DATA_HW_EVENT;
  message.channels_set = channel;
  message.pbuf = NULL;
  message.netif = NULL;
  message.p_eth = p_eth;

  /* RX(ACK) 이벤트는 큐 front 로 넣어 앞서 쌓인 TX-complete/제출 메시지보다
     먼저 처리되게 한다 -> 창을 푸는 ACK 의 head-of-line blocking 완화, TX 처리량 향상.
     (RX 이벤트 순서가 바뀌어도 ExecDataHandler 가 RX 링을 순서대로 비우므로 안전) */
  if ((channel & HAL_ETH_RX_CHANNEL_ALL) != 0U)
  {
    xQueueSendToFrontFromISR(data_worker_queue, &message, &xHigherPriorityTaskWoken1);
  }
  else
  {
    xQueueSendToBackFromISR(data_worker_queue, &message, &xHigherPriorityTaskWoken1);
  }
  vTaskNotifyGiveFromISR(data_worker_task, &xHigherPriorityTaskWoken2);
  portYIELD_FROM_ISR((xHigherPriorityTaskWoken1) || (xHigherPriorityTaskWoken2));
}

/**
  * @brief  Ethernet Rx Transfer completed callback.
  *         Called from HAL_ETH_ExecHandler() when some data was received on a channel.
  * @param  heth: ETH handle
  * @retval None
  */
hal_status_t rx_complete_cb(hal_eth_handle_t *p_eth, uint32_t channel,
                            void *rx_pkt_address, uint32_t rx_pkt_size,
                            hal_eth_rx_cb_pkt_data_t rx_pkt_data)
{
  struct pbuf *pbuf = (struct pbuf *)rx_pkt_data.p_data;
  const uint32_t channel_idx = GET_RX_CHANNEL_INDEX_FROM_HAL_ETH_RX_CHANNEL_ID(channel);
  struct pbuf *first_pbuf = NULL;
  struct netif *p_netif = NULL;
  hal_status_t hal_status = HAL_OK;
  err_t lwip_err = ERR_OK;

  if (rx_pkt_data.errors)
  {
    pbuf_free(pbuf);
  }
  else
  {
    if (channel_idx >= MX_LWIP_MAX_INTERFACE_NB)
    {
      LWIP_ASSERT("rx_complete_cb channel_idx < MX_LWIP_MAX_INTERFACE_NB", 0);
      return HAL_ERROR;
    }
    first_pbuf = first_pbuf_table[channel_idx];

    pbuf->len = rx_pkt_size;
    pbuf->tot_len = rx_pkt_size;

    if (rx_pkt_data.status & HAL_ETH_RX_STATUS_FD)
    {
      if (first_pbuf != NULL)
      {
        /* First pbuf has not been received because of abort Rx frame, free it */
        pbuf_free(first_pbuf);
      }
      first_pbuf = pbuf;
      /* Store first pbuf entry in table */
      first_pbuf_table[channel_idx] = first_pbuf;
    }
    else
    {
      /* Chain pbuf is not first chunk of received frame */
      pbuf_chain(first_pbuf, pbuf);
    }


    /* provide the received frame to IP stack if last chunk */
    if (rx_pkt_data.status & HAL_ETH_RX_STATUS_LD)
    {

      /* find netif from ETH IP instance, channel, VLAN */
      p_netif = get_netif_from_table(p_eth, channel, rx_pkt_data.vlan_tag_ids);
      if (p_netif != NULL)
      {
        lwip_err = p_netif->input(first_pbuf, p_netif);
        if (lwip_err != ERR_OK)
        {
          /* tcpip_input() 실패(ERR_MEM): tcpip mailbox / MEMP_TCPIP_MSG_INPKT
             고갈 = RX 오버로드. tcpip_input()은 실패 시 pbuf를 free하지 않고
             호출자에게 소유권을 남기므로 여기서 직접 free한다. UDP 오버로드
             시 패킷 드롭은 정상 동작이므로 assert로 죽지 않고 드롭 처리한다. */
          pbuf_free(first_pbuf);
          s_eth_stats.rx_drop_mbox++;
        }
      }
      else
      {
        /* no netif found, free the pbuf chain */
        pbuf_free(first_pbuf);
      }

