chcbaram/NUCLEO-C5A3ZG/firmware/stm32c5-ai/src/lib/lwip/interfaces/ethernet/eth_interface_freertos.c
      /* 성공/드롭/무netif 모두 first_pbuf는 소비(또는 free)되었으므로 엔트리 정리.
         hal_status는 HAL_OK 유지 → HAL이 RX 디스크립터를 정상 반환하게 한다. */
      first_pbuf_table[channel_idx] = NULL;
    }
  }

  return hal_status;
}

/* Public Functions Definitions ----------------------------------------------*/

err_t lwip_eth_interface_low_level_output(struct netif *netif, struct pbuf *p)
{
  struct pbuf *q = NULL;
  BaseType_t rtos_val = pdPASS;
  data_worker_message_t message;

  LWIP_ASSERT("pbuf_clen < MX_LWIP_MAX_ETH_TX_BUFFERS", pbuf_clen(p) < MX_LWIP_MAX_ETH_TX_BUFFERS);

  /* Increment the reference counter of the pbufs
     to avoid them being re-used immediately by LwIP.
     They will be freed with pbuf_free() in last TX complete callback */
  for (q = p; q != NULL; q = q->next)
  {
    pbuf_ref(q);
  }

  message.type = MW_OUTPUT_BUFFER;
  message.netif = netif;
  message.pbuf = p;

  rtos_val = xQueueSend(data_worker_queue, &message, pdMS_TO_TICKS(MX_LWIP_DATA_WORKER_QUEUE_TX_TIMEOUT_MS));

  LWIP_ASSERT("xQueueSend() == pdPASS", rtos_val == pdPASS);
  if (rtos_val == pdPASS)
  {
    xTaskNotifyGive(data_worker_task);
    return ERR_OK;
  }
  else
  {
    return ERR_MEM;
  }
}

err_t lwip_eth_interface_low_level_init(struct netif *p_netif)
{
  err_t err = ERR_OK;
  hal_status_t hal_status;
  lwip_eth_interface_netif_context_t *p_netif_context = NULL;
  hal_eth_channel_state_t channel_rx_state;
  hal_eth_channel_state_t channel_tx_state;
  bool hw_interface_is_used;
  uint32_t rx_channel_idx;
  uint32_t tx_channel_idx;
  void *rx_channel_desc_memory;
  void *tx_channel_desc_memory;
  uint32_t align;

  if (p_netif == NULL || (p_netif->state == NULL))
  {
    return ERR_VAL;
  }

  p_netif_context = (lwip_eth_interface_netif_context_t *)p_netif->state;

  if ((p_netif_context->p_hardware == NULL) || (p_netif_context->p_hardware->p_eth == NULL)
      || (p_netif_context->p_hardware->p_phy == NULL))
  {
    return ERR_VAL;
  }

  rx_channel_idx = GET_RX_CHANNEL_INDEX_FROM_HAL_ETH_RX_CHANNEL_ID(p_netif_context->rx_channel_id);
  if (rx_channel_idx >= MX_LWIP_MAX_INTERFACE_NB)
  {
    LWIP_ASSERT("lwip_eth_interface_low_level_init rx_channel_idx < MX_LWIP_MAX_INTERFACE_NB", 0);
    return ERR_VAL;
  }

  tx_channel_idx = GET_TX_CHANNEL_INDEX_FROM_HAL_ETH_TX_CHANNEL_ID(p_netif_context->tx_channel_id);
  if (tx_channel_idx >= MX_LWIP_MAX_INTERFACE_NB)
  {
    LWIP_ASSERT("lwip_eth_interface_low_level_init tx_channel_idx < MX_LWIP_MAX_INTERFACE_NB", 0);
    return ERR_VAL;
  }

  /* Start Rx Channel */
  channel_rx_state = HAL_ETH_GetChannelState(p_netif_context->p_hardware->p_eth, p_netif_context->rx_channel_id);
  if ((channel_rx_state != HAL_ETH_CHANNEL_STATE_ACTIVE) && (channel_rx_state != HAL_ETH_CHANNEL_STATE_SUSPENDED))
  {
    /* register allocate callback called by HAL_ETH_ExecDataHandler() */
    hal_status = HAL_ETH_RegisterChannelRxAllocateCallback(p_netif_context->p_hardware->p_eth,
                                                           p_netif_context->rx_channel_id, rx_allocate_cb);

    HAL_ETH_RegisterChannelRxCptCallback(p_netif_context->p_hardware->p_eth, p_netif_context->rx_channel_id,
                                         rx_complete_cb);

    hal_eth_channel_alloc_needs_t rx_eth_alloc_req = {0};
    HAL_ETH_GetChannelAllocNeeds(p_netif_context->p_hardware->p_eth, p_netif_context->rx_channel_id, &rx_eth_alloc_req);

    align = rx_eth_alloc_req.mem_addr_align_byte;
    rx_desc_pointer_table[rx_channel_idx] = pvPortMalloc(rx_eth_alloc_req.mem_size_byte + align);
    if (rx_desc_pointer_table[rx_channel_idx] == NULL)
    {
      LWIP_ASSERT("alloc channel memory RX", 0);
      err = ERR_MEM;
    }
    else
    {
      rx_channel_desc_memory = ALIGN_DESC_MEM(rx_desc_pointer_table[rx_channel_idx], align);
      LWIP_ASSERT("Align desc Rx", (uint32_t)rx_channel_desc_memory % rx_eth_alloc_req.mem_addr_align_byte == 0);

      hal_status = HAL_ETH_StartChannel(p_netif_context->p_hardware->p_eth, p_netif_context->rx_channel_id,
                                        rx_channel_desc_memory, rx_eth_alloc_req.mem_size_byte);
      if (hal_status != HAL_OK)
      {
        vPortFree(rx_desc_pointer_table[rx_channel_idx]);
        LWIP_ASSERT("HAL_ETH_StartChannel RX hal_status == HAL_OK", 0);
        err = ERR_IF;
      }
    }
  }

  /* Start Tx Channel */
  if (err == ERR_OK)
  {
    channel_tx_state = HAL_ETH_GetChannelState(p_netif_context->p_hardware->p_eth, p_netif_context->tx_channel_id);
    if ((channel_tx_state != HAL_ETH_CHANNEL_STATE_ACTIVE) && (channel_tx_state != HAL_ETH_CHANNEL_STATE_SUSPENDED))
    {
      HAL_ETH_RegisterChannelTxCptCallback(p_netif_context->p_hardware->p_eth, p_netif_context->tx_channel_id,
                                           tx_complete_cb);

      hal_eth_channel_alloc_needs_t tx_eth_alloc_req = {0};
      HAL_ETH_GetChannelAllocNeeds(p_netif_context->p_hardware->p_eth, p_netif_context->tx_channel_id, &tx_eth_alloc_req);

      align = tx_eth_alloc_req.mem_addr_align_byte;
      tx_desc_pointer_table[tx_channel_idx] = pvPortMalloc(tx_eth_alloc_req.mem_size_byte + align);
      if (tx_desc_pointer_table[tx_channel_idx] == NULL)
      {
        LWIP_ASSERT("alloc channel memory TX", 0);
        err = ERR_MEM;
      }
      else
      {
        tx_channel_desc_memory = ALIGN_DESC_MEM(tx_desc_pointer_table[tx_channel_idx], align);
        LWIP_ASSERT("Align desc Tx", (uint32_t)tx_channel_desc_memory % align == 0);

        hal_status = HAL_ETH_StartChannel(p_netif_context->p_hardware->p_eth, p_netif_context->tx_channel_id,
                                          tx_channel_desc_memory, tx_eth_alloc_req.mem_size_byte);
        if (hal_status != HAL_OK)
        {
          vPortFree(tx_desc_pointer_table[tx_channel_idx]);
          LWIP_ASSERT("HAL_ETH_StartChannel TX hal_status == HAL_OK", 0);
          err = ERR_IF;
        }
      }
    }
  }

  if (err == ERR_OK)
  {
    /* Check if hardware interface is used by another network interface and register data callback if not */
    hw_interface_is_used = hardware_interface_is_used(p_netif_context);
    if (hw_interface_is_used == false)
    {
      hal_status = HAL_ETH_RegisterDataCallback(p_netif_context->p_hardware->p_eth, data_event_cb);
      if (hal_status != HAL_OK)
      {
        LWIP_ASSERT("HAL_ETH_RegisterDataCallback hal_status == HAL_OK", 0);
        err = ERR_IF;
      }
    }
  }

  /* Fill netif context table */
  if (err == ERR_OK)
  {
    err = netif_context_add_to_table(p_netif_context);
  }

  /* Fill phy state table */
  if (err == ERR_OK)
  {
    err = phy_state_add_to_table(p_netif_context);
    if (err == ERR_ALREADY)
    {
      err = ERR_OK;
    }
  }


