chcbaram/NUCLEO-C5A3ZG/firmware/stm32c5-ai/src/lib/lwip/interfaces/ethernet/eth_interface_freertos.c
  if (err == ERR_OK)
  {
    /* set MAC hardware address in LwIP netif */
    p_netif->hwaddr_len = ETH_HWADDR_LEN;
    hal_eth_config_t hal_eth_config;
    HAL_ETH_GetConfig(p_netif_context->p_hardware->p_eth, &hal_eth_config);
    memcpy(p_netif->hwaddr, &hal_eth_config.mac_addr[0], sizeof(hal_eth_config.mac_addr));
  }


  if (err != ERR_OK)
  {
    lwip_eth_interface_low_level_deinit(p_netif);
  }

  return err;
}


err_t lwip_eth_interface_low_level_deinit(struct netif *p_netif)
{
  hal_status_t hal_status;
  lwip_eth_interface_netif_context_t *p_netif_context = NULL;
  bool hw_interface_is_used;
  bool netif_removed;

  uint32_t rx_channel_idx;
  uint32_t tx_channel_idx;

  if (p_netif == NULL || (p_netif->state == NULL))
  {
    return ERR_VAL;
  }

  p_netif_context = (lwip_eth_interface_netif_context_t *)p_netif->state;

  if ((p_netif_context->p_hardware == NULL) || (p_netif_context->p_hardware->p_eth == NULL)
      || (p_netif_context->p_hardware->p_phy == NULL))
  {
    return ERR_VAL;
  }

  netif_removed = netif_context_remove_from_table(p_netif_context);
  if (netif_removed == true)
  {
    phy_state_remove_from_table(p_netif_context);

    /* Check if hardware interface is used by another network interface */
    hw_interface_is_used = hardware_interface_is_used(p_netif_context);
    if (hw_interface_is_used == false)
    {
      hal_status = HAL_ETH_StopChannel(p_netif_context->p_hardware->p_eth, p_netif_context->rx_channel_id);
      LWIP_ASSERT("HAL_ETH_StopChannel RX hal_status == HAL_OK", hal_status == HAL_OK);

      rx_channel_idx = GET_RX_CHANNEL_INDEX_FROM_HAL_ETH_RX_CHANNEL_ID(p_netif_context->rx_channel_id);
      if (rx_channel_idx < MX_LWIP_MAX_INTERFACE_NB)
      {
        if (rx_desc_pointer_table[rx_channel_idx] != NULL)
        {
          vPortFree(rx_desc_pointer_table[rx_channel_idx]);
          rx_desc_pointer_table[rx_channel_idx] = NULL;
        }
        else
        {
          LWIP_ASSERT("lwip_eth_interface_low_level_deinit rx_desc_pointer_table[rx_channel_idx] == NULL", 0);
        }
      }
      else
      {
        LWIP_ASSERT("lwip_eth_interface_low_level_deinit rx_channel_idx < MX_LWIP_MAX_INTERFACE_NB", 0);
      }

      hal_status = HAL_ETH_StopChannel(p_netif_context->p_hardware->p_eth, p_netif_context->tx_channel_id);
      LWIP_ASSERT("HAL_ETH_StopChannel TX hal_status == HAL_OK", hal_status == HAL_OK);

      tx_channel_idx = GET_TX_CHANNEL_INDEX_FROM_HAL_ETH_TX_CHANNEL_ID(p_netif_context->tx_channel_id);
      if (tx_channel_idx < MX_LWIP_MAX_INTERFACE_NB)
      {
        if (tx_desc_pointer_table[tx_channel_idx] != NULL)
        {
          vPortFree(tx_desc_pointer_table[tx_channel_idx]);
          tx_desc_pointer_table[tx_channel_idx] = NULL;
        }
        else
        {
          LWIP_ASSERT("lwip_eth_interface_low_level_deinit tx_desc_pointer_table[tx_channel_idx] == NULL", 0);
        }
      }
      else
      {
        LWIP_ASSERT("lwip_eth_interface_low_level_deinit tx_channel_idx < MX_LWIP_MAX_INTERFACE_NB", 0);
      }
    }
  }
  return ERR_OK;
}

err_t lwip_eth_interface_init(void)
{
  err_t err = ERR_OK;

  if ((err == ERR_OK) && (eth_tx_buffer == NULL))
  {
    eth_tx_buffer = pvPortMalloc(MX_LWIP_MAX_ETH_TX_BUFFERS * sizeof(hal_eth_buffer_t *));
    if (eth_tx_buffer == NULL)
    {
      LWIP_ASSERT("eth_tx_buffer creation failed", eth_tx_buffer);
      err =  ERR_MEM;
    }
  }
  else
  {
    err =  ERR_MEM;
  }

  if ((err == ERR_OK) && (netif_context_table_mutex == NULL))
  {
    netif_context_table_mutex = xSemaphoreCreateRecursiveMutex();
  }
  else
  {
    err =  ERR_MEM;
  }

  if ((err == ERR_OK) && (phy_state_table_mutex == NULL))
  {
    phy_state_table_mutex = xSemaphoreCreateRecursiveMutex();
  }
  else
  {
    err =  ERR_MEM;
  }


  if ((err == ERR_OK) && (data_worker_queue == NULL))
  {
    data_worker_queue = xQueueCreate(MX_LWIP_DATA_WORKER_QUEUE_SIZE, sizeof(data_worker_message_t));
    if (data_worker_queue == NULL)
    {
      LWIP_ASSERT("Message queue creation failed", data_worker_queue);
      err =  ERR_MEM;
    }
  }
  else
  {
    err =  ERR_MEM;
  }

  if ((err == ERR_OK) && (data_worker_task == NULL))
  {
    if (xTaskCreate(
          data_worker_thread,
          "EthDataWorker",
          MX_LWIP_DATA_WORKER_STACK_SIZE / sizeof(StackType_t), (void *)NULL, MX_LWIP_DATA_WORKER_PRIORITY,
          &data_worker_task) != pdPASS)
    {
      LWIP_ASSERT("data worker task creation failed", false);
      err = ERR_MEM;
    }
  }
  else
  {
    err =  ERR_MEM;
  }

  if ((err == ERR_OK) && (link_monitor_task == NULL))
  {
    if (xTaskCreate(phy_link_monitor_thread,
                    "EthLinkMonitor",
                    MX_LWIP_LINK_MONITOR_STACK_SIZE / sizeof(StackType_t), (void *)NULL, MX_LWIP_LINK_MONITOR_PRIORITY,
                    &link_monitor_task) != pdPASS)
    {
      LWIP_ASSERT("link monitor task creation failed", false);
      err = ERR_MEM;
    }
  }
  else
  {
    err =  ERR_MEM;
  }

  if (err != ERR_OK)
  {
    (void) lwip_eth_interface_deinit();
  }

  return err;
}

err_t lwip_eth_interface_deinit(void)
{
  err_t err = ERR_MEM;

  bool empty = netif_context_table_is_empty();

  if (empty == true)
  {
    err = ERR_OK;

    RunDataWorkerThread = pdFALSE;
    RunLinkMonitorThread = pdFALSE;

    if (data_worker_task != NULL)
    {
      xTaskNotifyGive(data_worker_task);
      data_worker_task = NULL;
    }
    link_monitor_task = NULL;
    if (eth_tx_buffer != NULL)
    {
      vPortFree(eth_tx_buffer);
      eth_tx_buffer = NULL;
    }
    if (data_worker_queue != NULL)
    {
      vQueueDelete(data_worker_queue);
      data_worker_queue = NULL;
    }
    if (netif_context_table_mutex != NULL)
    {
      vSemaphoreDelete(netif_context_table_mutex);
      netif_context_table_mutex = NULL;
    }
    if (phy_state_table_mutex != NULL)
    {
      vSemaphoreDelete(phy_state_table_mutex);
      phy_state_table_mutex = NULL;
    }
  }

  return err;
}


void lwip_eth_interface_link_monitor_event_notify_from_isr(void)
{
  BaseType_t xHigherPriorityTaskWoken = pdFALSE;
  if (link_monitor_task != NULL)
  {
    vTaskNotifyGiveFromISR(link_monitor_task, &xHigherPriorityTaskWoken);
    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
  }
}

void lwip_eth_interface_get_stats(lwip_eth_interface_stats_t *p_stats)
{
  if (p_stats != NULL)
  {
    /* 카운터는 32-bit 정렬 접근이라 tearing 없이 스냅샷 가능 */
    p_stats->rx_drop_mbox = s_eth_stats.rx_drop_mbox;
    p_stats->rx_drop_pbuf = s_eth_stats.rx_drop_pbuf;
  }
}

void lwip_eth_interface_clear_stats(void)
{
  s_eth_stats.rx_drop_mbox = 0;
  s_eth_stats.rx_drop_pbuf = 0;
}
